translates = {
    "zh": {
        "btnRunName": "开始计算!",
        "btnFastModeName": "执行极速计算!",
        "calcText": "正在计算中......",
        "fastModeText": "正在后台计算中......",
        "invalidItemsText": "检测到错误的输入! 请检查并重试!",
        "calcEndText": "计算完成!"
    },
    "en": {
        "btnRunName": "RUN!!!",
        "btnFastModeName": "FAST MODE!!!",
        "calcText": "Calculating......",
        "fastModeText": "Calculating in the background......",
        "invalidItemsText": "Invalid item(s) appeared. Please check and retry.",
        "calcEndText": "Finished!"
    }
}

sudoku1 = [
    [8, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 3, 6, 0, 0, 0, 0, 0],
    [0, 7, 0, 0, 9, 0, 2, 0, 0],
    [0, 5, 0, 0, 0, 7, 0, 0, 0],
    [0, 0, 0, 0, 4, 5, 7, 0, 0],
    [0, 0, 0, 1, 0, 0, 0, 3, 0],
    [0, 0, 1, 0, 0, 0, 0, 6, 8],
    [0, 0, 8, 5, 0, 0, 0, 1, 0],
    [0, 9, 0, 0, 0, 0, 4, 0, 0]
]

sudoku2 = [
    [7, 4, 0, 2, 0, 9, 0, 0, 0],
    [0, 2, 0, 0, 8, 4, 0, 9, 0],
    [8, 0, 0, 0, 0, 3, 4, 0, 0],
    [5, 8, 0, 3, 0, 0, 0, 0, 0],
    [0, 0, 1, 0, 6, 0, 5, 0, 0],
    [0, 0, 0, 0, 0, 5, 0, 1, 9],
    [0, 0, 7, 5, 0, 0, 0, 0, 1],
    [0, 5, 0, 1, 4, 0, 0, 7, 0],
    [0, 0, 0, 9, 0, 2, 0, 5, 4]
]

sudoku3 = [
    [0, 8, 0, 0, 0, 0, 0, 0, 0],
    [0, 1, 5, 0, 9, 0, 0, 0, 0],
    [0, 0, 0, 6, 0, 8, 1, 0, 0],
    [5, 0, 0, 3, 4, 0, 2, 0, 0],
    [1, 7, 0, 0, 0, 0, 0, 9, 4],
    [0, 0, 3, 0, 8, 9, 0, 0, 1],
    [0, 0, 9, 5, 0, 4, 0, 0, 0],
    [0, 0, 0, 0, 3, 0, 6, 7, 0],
    [0, 0, 0, 0, 0, 0, 0, 5, 0]
]